In [1]:
import pandas as pd 
import sqlite3 as sql

In [2]:
tips = pd.read_csv('https://raw.github.com/pandas-dev/pandas/master/pandas/tests/io/data/csv/tips.csv')

In [3]:
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [4]:
conn = sql.connect('tips.db')
cur = conn.cursor()

In [5]:
tips.to_sql(name='tips', con=conn)
conn.close()

ValueError: Table 'tips' already exists.

In [6]:
cur.execute('SELECT total_bill, tip, smoker, time FROM tips LIMIT 5;')
for a in cur:
    print (a)

(16.99, 1.01, 'No', 'Dinner')
(10.34, 1.66, 'No', 'Dinner')
(21.01, 3.5, 'No', 'Dinner')
(23.68, 3.31, 'No', 'Dinner')
(24.59, 3.61, 'No', 'Dinner')

In [7]:
cur.execute('SELECT * FROM tips WHERE time = "Dinner" LIMIT 5;')
for b in cur:
    print (b)

(0, 16.99, 1.01, 'Female', 'No', 'Sun', 'Dinner', 2)
(1, 10.34, 1.66, 'Male', 'No', 'Sun', 'Dinner', 3)
(2, 21.01, 3.5, 'Male', 'No', 'Sun', 'Dinner', 3)
(3, 23.68, 3.31, 'Male', 'No', 'Sun', 'Dinner', 2)
(4, 24.59, 3.61, 'Female', 'No', 'Sun', 'Dinner', 4)

In [8]:
cur.execute('SELECT * FROM tips WHERE size >= 5 OR total_bill > 45;')
for c in cur:
    print (c)

(59, 48.27, 6.73, 'Male', 'No', 'Sat', 'Dinner', 4)
(125, 29.8, 4.2, 'Female', 'No', 'Thur', 'Lunch', 6)
(141, 34.3, 6.7, 'Male', 'No', 'Thur', 'Lunch', 6)
(142, 41.19, 5.0, 'Male', 'No', 'Thur', 'Lunch', 5)
(143, 27.05, 5.0, 'Female', 'No', 'Thur', 'Lunch', 6)
(155, 29.85, 5.14, 'Female', 'No', 'Sun', 'Dinner', 5)
(156, 48.17, 5.0, 'Male', 'No', 'Sun', 'Dinner', 6)
(170, 50.81, 10.0, 'Male', 'Yes', 'Sat', 'Dinner', 3)
(182, 45.35, 3.5, 'Male', 'Yes', 'Sun', 'Dinner', 3)
(185, 20.69, 5.0, 'Male', 'No', 'Sun', 'Dinner', 5)
(187, 30.46, 2.0, 'Male', 'Yes', 'Sun', 'Dinner', 5)
(212, 48.33, 9.0, 'Male', 'No', 'Sat', 'Dinner', 4)
(216, 28.15, 3.0, 'Male', 'Yes', 'Sat', 'Dinner', 5)

In [9]:
cur.execute('SELECT sex, count(*) FROM tips GROUP BY sex;')
for d in cur:
    print (d)

('Female', 87)
('Male', 157)

In [16]:
for g in cur.execute('UPDATE tips SET tip = tip*2 WHERE tip < 2;')
    print (g)

SyntaxError: invalid syntax (<ipython-input-16-29064b698d3d>, line 1)